Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.OperationStatus Enumeration
 Define possible statuses for geometry creation/modification commands.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum OperationStatus
Public Enumeration OperationStatus
Members
Member name | Value | Description
Success | 0 |  Status on success creation.
Failure | 1 |  General failure mode.
FacePerpendicularToIntersectionLine | 2 |  Face perpendicular to intersection line.
PlateIntersectsWithIntersectionLine | 3 |  Plate polygon extends beyond intersection line.
ExtensionIntersectsWithPlate | 4 |  Extension plate clashes with plates.
FacesTooNearEachOther | 5 |  Faces to be connected overlap.
FacesAtAnObtuseAngle | 6 |  Faces to be connected are too steep of an angle.
UndefinedCurveDirection | 7 |  Can't make inward/outward curve check.
UnsupportedChamfer | 8 |  Plates containing unsupported chamfer information.
InvalidRadius | 9 |  Cannot connect parts with a cylindrical section having the provided radius.
InvalidFacePoints | 10 |  Cannot create geometry from requested face points.
See Also
Reference
Tekla.Structures.Model Namespace